In [2]:
import numpy as np
import pandas as pd

In [3]:
string_data= pd.Series(['aaajdkj','sdafaf',np.nan,'adafda'])
string_data

0    aaajdkj
1     sdafaf
2        NaN
3     adafda
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]#等价

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned = data.dropna()# 默认丢弃所有NA的行
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.399028       NaN       NaN
1 -0.607393       NaN       NaN
2 -0.794319       NaN  0.210721
3  0.123589       NaN -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [12]:
df.dropna()

          0         1         2
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [13]:
df.dropna(thresh=2)

          0         1         2
2 -0.794319       NaN  0.210721
3  0.123589       NaN -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [14]:
df.fillna(0)

          0         1         2
0 -1.399028  0.000000  0.000000
1 -0.607393  0.000000  0.000000
2 -0.794319  0.000000  0.210721
3  0.123589  0.000000 -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [15]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.399028  0.500000  0.000000
1 -0.607393  0.500000  0.000000
2 -0.794319  0.500000  0.210721
3  0.123589  0.500000 -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [16]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0 -1.399028  0.000000  0.000000
1 -0.607393  0.000000  0.000000
2 -0.794319  0.000000  0.210721
3  0.123589  0.000000 -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [17]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -1.019765 -1.357025 -0.450740
1 -0.270612  0.631953 -1.313154
2  0.124383       NaN  0.121109
3 -0.865180       NaN  1.251292
4 -0.939664       NaN       NaN
5 -0.738088       NaN       NaN

In [19]:
df.fillna(method='ffill')

          0         1         2
0 -1.019765 -1.357025 -0.450740
1 -0.270612  0.631953 -1.313154
2  0.124383  0.631953  0.121109
3 -0.865180  0.631953  1.251292
4 -0.939664  0.631953  1.251292
5 -0.738088  0.631953  1.251292

In [20]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.019765 -1.357025 -0.450740
1 -0.270612  0.631953 -1.313154
2  0.124383  0.631953  0.121109
3 -0.865180  0.631953  1.251292
4 -0.939664       NaN  1.251292
5 -0.738088       NaN  1.251292

In [21]:
data = pd.Series([1,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [23]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4,]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [24]:
import re
text = "fool bar\t baz \tqux"
re.split('\s+',text)

['fool', 'bar', 'baz', 'qux']

In [25]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
re.compile(pattern,flags=re.IGNORECASE).findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [26]:
data = {'Dave':'dave@google.com',
       'Steve':'steve@gmail.com',
       'Rob':'rob@gmail.com',
       'Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [27]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [29]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [30]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object